Repository: mlutken/airplay
Catalog: drupal/sites/all/modules/corner/translations/*.po
Languages: hu

source: delete
hu: törlés

source: Operations
hu: Műveletek

source: Delete
hu: Törlés

source: Cancel
hu: Mégsem

source: Save
hu: Mentés

source: List
hu: Lista

source: configure
hu: beállítás

source: Role specific visibility settings
hu: Felhasználói csoportoktól függő megjelenítés

source: Page specific visibility settings
hu: Oldalaktól függő megjelenítés

source: Show on every page except the listed pages.
hu: A felsorolt oldalak kivételével mindenütt jelenjen meg.

source: Show on only the listed pages.
hu: Csak a felsorolt oldalakon jelenjen meg.

source: Enter one page per line as Drupal paths. The '*' character is a wildcard. Example paths are %blog for the blog page and %blog-wildcard for every personal blog. %front is the front page.
hu: Soronként egy Drupal elérési útvonalat kell megadni. A „*” használható speciális helyettesítőként. Példák: „%blog” a blogok főoldalához és „%blog-wildcard” a személyes blogok főoldalaihoz. „%front” a címlapot jelenti.

source: Show if the following PHP code returns <code>TRUE</code> (PHP-mode, experts only).
hu: Csak abban az esetben jelenik meg, ha a következő PHP kód <code>TRUE</code> értékkel tér vissza (PHP-módban, csak tapasztaltaknak ajánlott).

source: If the PHP-mode is chosen, enter PHP code between %php. Note that executing incorrect PHP-code can break your Drupal site.
hu: Ha a PHP-mód lett kiválasztva, a PHP kód megadható %php jelölések között. Hibásan megadott PHP kód működésképtelenné teheti a webhelyet!

source: Pages
hu: Oldalak

source: Location
hu: Hely

source: clone
hu: klónozás

source: Fixed
hu: Rögzített

source: Position
hu: Elhelyezkedés

source: Image
hu: Kép

source: disable
hu: letiltás

source: enable
hu: engedélyezés

source: Corner
hu: Szögletkép

source: --- select ---
hu: --- kiválasztás ---

source: Corner info
hu: Szögletkép információ

source: Enable corner
hu: Szögletkép engedélyezése

source: If this setting is enabled, the current corner is shown on the configured pages (see specific options below).
hu: Ha ez az opció engedélyezve van, akkor az aktuális szögletkép meg fog jelenni a beállított lapokon (a szükséges beállításokat lásd alant).

source: Corner name
hu: Szögletkép neve

source: The name of the corner.
hu: A szögletkép neve.

source: Corner details
hu: Szögletkép részletei

source: Corner image
hu: Kép a szögletképhez

source: Select which corner to show. You can add additional images (PNG-24) to the %images directory inside the module.
hu: Itt választható ki a megjelenítésre szánt szögletkép. Lehetőség van további képek hozzáadására is a <em>Szögletkép</em> modul %images könyvtárában.

source: Corner position
hu: Szögletkép elhelyezkedése

source: Corner title
hu: Szögletkép címe

source: If you enter a title, the corner will use it in its title propery. Leave empty for none.
hu: Ha ide valamilyen szöveg kerül beírásra, akkor a szögletkép azt használni fogja cím gyanánt. Ha erre nincs szükség, a mező üresen hagyható.

source: Corner link URI
hu: Szögletképben szereplő hivatkozás (URI)

source: If you enter a URI, the corner will be made clickable. Use &lt;front&gt; for the front page of the site. Leave empty to disable making the corner into a link.
hu: Ha ide egy webcím kerül, akkor a szögletkép bannerként fog működni. A &lt;front&gt; megadásával ennek a webhelynek a kezdőlapjára fog mutatni a hivatkozás. Üresen hagyva nem fog hivatkozást tartalmazni.

source: Show corner for specific roles
hu: Szögletkép megjelenítése meghatározott jogosultságúaknak

source: Show the corner only for the selected role(s). If you select no roles, the corner will be visible to all users.
hu: A szögletkép megjelenítése csak a kiválasztott jogosultságokkal rendelkező felhasználóknak. Ha egyik jogosultság sincs bejelölve, akkor mindenki számára látható lesz.

source: Show corner on specific pages
hu: Szögletkép megjelenítése meghatározott lapokon

source: !field field is required.
hu: !field mező szükséges.

source: The corner %name has been saved.
hu: %name nevű szögletkép elmentve.

source: The corner %name has been created.
hu: %name nevű szögletkép létrehozva.

source: Are you sure you want to delete the corner %name?
hu: %name nevű szögletkép valóban törölhető?

source: The corner %name has been removed.
hu: %name nevű szögletkép eltávolítva.

source: Shows configurable corner corners on your site.
hu: Beállítható szögletképek megjelenítése az oldalon.

source: add corner page
hu: szögletkép hozzáadása

source: Corners are images which are shown at the top of pages - in the left or right 'corner'. Create new corners on the !add_new or configure existing corners by clicking the %configure link next to each one.
hu: A szögletképek olyan képek, amelyek a lap tetején - a bal vagy jobb oldali sarokban, „szögletben” - jelennek meg. Új szögletképet a !add_new oldalon lehet létrehozni, illetve a létező szögletképek beállítása az adott sorban lévő %configure hivatkozásra kattintva érhető el.

source: Configure corners, including what they are and where they appear on the site.
hu: Szögletképek beállítása, beleértve azt is, hogy mikor és hol tünjenek fel a webhelyen.

source: administer corners
hu: szögletképek adminisztrációja

source: use PHP for corner visibility
hu: PHP kód használata a szögletkép láthatóságához

source: Corners
hu: Szögletképek

source: Add corner
hu: Szögletkép hozzáadása

source: Configure corner
hu: Szögletkép beállítása

source: Clone corner
hu: Szögletkép klónozása

source: Delete corner
hu: Szögletkép törlése

source: Disables corner
hu: Szögletkép tiltása

source: Enables corner
hu: Szögletkép engedélyezése

source: corner
hu: szögletkép

source: Stores corner settings, such as image and visibility settings.
hu: Tárolja a szögletkép beállításait, mint kép és láthatósági beállítások.

source: Primary Key: Unique corner ID.
hu: Elsődleges kulcs: egyedi szögletkép azonosító.

source: Name of the corner. The name will be added to the corner class to enable custom theming.
hu: A szögletkép neve. A név hozzá lesz adva a corner osztályhoz, hogy engedélyezze az egyedi sminkelést.

source: The filename of the corner to be shown.
hu: A szögletkép fájlneve meg fog jelenni.

source: The title of the corner image.
hu: A szögletkép címe.

source: Link URI of corner.
hu: A szögletkép által hivatkozott webcím.

source: Corner enabled status. (1 = enabled, 0 = disabled)
hu: Szögletkép engedélyezési állapot (1 = engedélyezve, 0 = tiltva)

source: Flag to indicate how to show corners on pages. (0 = Show on all pages except listed pages, 1 = Show only on listed pages, 2 = Use custom PHP code to determine visibility)
hu: Jelző, mely mutatja, hogyan jelenjenek meg a szögletképek az oldalakon. (0 = Mutassa minden oldalon, kivéve a felsoroltakat, 1 = Csak a felsorolt oldalakon mutassa, 2 = Használjon egyedi PHP kódot a láthatóság megállapításához)

source: Contents of the "Pages" textarea; contains either a list of paths on which to include/exclude the corner or PHP code, depending on "visibility" setting.
hu: Az „Oldalak” szövegdoboz tartalma. Tartalmazza az útvonalak listáját, melyekkel megadható, hogy azokon a szögletkép megjelenjen, illetve eltűnjön, vagy a PHP kód, függően a „láthatósági” beállítástól.

source: Shows configurable image corners on your site.
hu: Beállítható szögletképek megjelenítése a webhelyen.

source: Linking
hu: Hivatkozás

source: Image map shape
hu: Képtérkép forma

source: --- none ---
hu: --- nincs ---

source: Circle
hu: Kör

source: Polygon
hu: Sokszög

source: Rectangle
hu: Téglalap

source: Turn the link into an image map by selecting a shape here and provide the appropritate image map coordates below.
hu: A hivatkozásra egy képtérképet lehet húzni. Ehhez ki kell választani itt egy formát, és lejjebb meg kell adni a megfelelő képtérkép korrdinátákat.

source: Image map coordinates
hu: Képtérkép koordináták

source: Image map coordinates on the form: [Cirle]: centerX,centerY,radius, [Polygon]: X1,Y1,X2,Y2,..,Xn,Yn, [Rectangle]: X1,Y1,X2,Y2.
hu: Képtérkép koordináták az űrlapon: [Kör]: origóX,origóY,rádiusz, [Sokszög]: X1,Y1,X2,Y2,..,Xn,Yn, [Téglalap]: X1,Y1,X2,Y2.

source: Positioning
hu: Elhelyezés

source: Corner location
hu: Szögletkép helye

source: The location of the corner on the page (left/right/top/bottom).
hu: A szögletkép helyzete a lapon (bal/jobb/fenn/lenn).

source: The position of the corner, relative to browser (fixed) or absolute (absolute). Usually, images located at the top of a page uses 'absolute' while images at the bottom of the page uses 'fixed'.
hu: A szögletkép elhelyezkedése a böngészőhöz rögzítetten, vagy abszolút módon történjen. A lap tetején elhelyezkedő képek általában abszolút, míg a lap alján elhelyezkedők rögzítettek szoktak lenni.

source: Language specific visibility settings
hu: Nyelvfüggő láthatósági beállítások

source: Show corner for specific languages
hu: A szögletképet a megadott nyelveknek mutassa

source: Show the corner only for the selected language(s). If you select no languages, the corner will be visible for all languages.
hu: A szögletképet csak a megadott nyelveknek mutassa. Ha nincs kiválasztott nyelv, akkor a szögletkép látható lesz minden nyelv számára.

source: Top left
hu: Fenn balra

source: Top right
hu: Fenn jobbra

source: Bottom left
hu: Lenn balra

source: Bottom right
hu: Lenn jobbra

source: Absolute
hu: Abszolút

source: The language visibility of the corner. Comma separated string of language names.
hu: A szögletkép nyelvi láthatósága. A nyelvek vesszővel elválasztott listája.

source: The role visibility of the corner. Comma separated string of role ids (rid).
hu: A szögletkép csoporti láthatósága. A csoportazonosítók vesszővel elválasztott listája.

source: Serialized array of various corner options.
hu: A szögletkép különböző beállításainak gépiesített tömbje.
