Repository: mlutken/airplay
Catalog: drupal/sites/all/modules/artist/translations/*.po
Languages: da

source: Sorry artist
da: Beklager kunstner

source: not found
da: ikke fundet

source: Discography
da: Diskografi

source: Year
da: År

source: Name
da: Navn

source: Time
da: Tid

source: Artist
da: Kunstner

source: More events on this day.
da: Flere hændelser denne dag

source: more
da: mere

source: Maximum number of links
da: Maksimalt antal links

source: The maximum number of links to display in the block.
da: Maks antal links der må vises i blokken.

source: You must enter an integer for the maximum number of links.
da: Du skal indtaste et heltal for maks. antal links.

source: Maximum number of links must be positive.
da: Maksimum antal links skal være et positivt heltal.

source: Displays the artist page in AirplayMusic Drupal CMS
da: Viser kunstner siden i AirplayMusic.

source: Artist module settings
da: access artist content
